* McDowell (2020) 14SB
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS:
#+begin_example
Name                                  | mcdowell_2021_14sb
Alternate name                        | 
Data source                           |  McDowell, I. E., Humphrey, N. F., Harper, J. T., and Meierbachtol, T. W.: The cooling signature of basal crevasses in a hard-bedded region of the Greenland Ice Sheet, The Cryosphere, 15, 897–907, https://doi.org/10.5194/tc-15-897-2021, 2021.
Drill year(s)                         | 2014
Data year(s)                          | August 2015
Longitude [°E]                        | -49.57216096
Latitude [°N]                         | 67.18095903
Approximate location name             | 
Location source                       | 
Ice thickness [m]                     | 677
Ice thickness year                    | 2014
Ice thickness source                  | See raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder
Surface velocity [m yr^-1]            | 
Surface velocity year                 | 
Surface velocity source               | 
Measured from: Top, Bottom, Relative  | B
Depth of top measurement [m]          | 496
Depth of bottom measurement [m]       | 676
#+end_example

** Temperature

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Thickness

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)
 
** Location

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC python :exports none
import numpy as np
import pandas as pd

df_bot = pd.read_csv("meta.bsv", sep="|", index_col=0, header=None, squeeze=True)
thick = np.float(df_bot['Ice thickness [m]'])
df = pd.read_csv('data_bottom.csv')
df = df[df.columns[::-1]]  # swap from d,t to t,d
df['d'] = thick - df['d']
df.to_csv('data.csv', index=False)
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k2
#+END_SRC

#+RESULTS:
|                   t |     d |
| -6.7676807420800005 | 496.0 |
|      -6.03099448168 | 516.0 |
|      -5.78765135148 | 526.0 |
|  -5.481808221280001 | 536.0 |
|      -5.11346509108 | 546.0 |
|  -4.807621960880001 | 556.0 |
|      -4.43927883068 | 566.0 |
|      -3.94593570048 | 576.0 |
| -3.5150925702800007 | 586.0 |
| -3.2092494400800002 | 596.0 |
|      -2.84090630988 | 606.0 |
|      -2.41006317968 | 616.0 |
|      -2.04172004948 | 626.0 |
|      -1.67337691928 | 636.0 |
|      -1.30503378908 | 646.0 |
|      -1.06169065888 | 656.0 |
|      -0.75584752868 | 666.0 |
| -0.5125043984800001 | 676.0 |

